app/controllers/criminals_controller.rb

SELECT "criminals".* FROM "criminals"
---
  def index
    @criminals = Criminal.all

INSERT INTO "criminals" ("first_name", "second_name", "identification_mark", "location_of_crime", "address", "height", "weight", "description", "gender", "age", "created_at", "updated_at", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "latitude", "longitude") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @criminal = Criminal.new(criminal_params)

    respond_to do |format|
      if @criminal.save

UPDATE "criminals" SET "avatar_file_name" = ?, "avatar_content_type" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "criminals"."id" = ?
---
  def update
    respond_to do |format|
      if @criminal.update(criminal_params)

DELETE FROM "criminals" WHERE "criminals"."id" = ?  [["id", 2]]
---
  def destroy
    @criminal.destroy

SELECT  "criminals".* FROM "criminals" WHERE "criminals"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def set_criminal
      @criminal = Criminal.find(params[:id])